In [1]:
import pandas as pd
import numpy as np
import plotly.express as px
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv("transactions.csv")
df

,index,City,Date,Card Type,Exp Type,Gender,Amount
0,0,"Delhi, India",29-Oct-14,Gold,Bills,F,82475
1,1,"Greater Mumbai, India",22-Aug-14,Platinum,Bills,F,32555
2,2,"Bengaluru, India",27-Aug-14,Silver,Bills,F,101738
3,3,"Greater Mumbai, India",12-Apr-14,Signature,Bills,F,123424
4,4,"Bengaluru, India",5-May-15,Gold,Bills,F,171574
...,...,...,...,...,...,...,...
26047,26047,"Kolkata, India",22-Jun-14,Silver,Travel,F,128191
26048,26048,"Pune, India",3-Aug-14,Signature,Travel,M,246316
26049,26049,"Hyderabad, India",16-Jan-15,Silver,Travel,M,265019
26050,26050,"Kanpur, India",14-Sep-14,Silver,Travel,M,88174
26051,26051,"Hyderabad, India",19-Oct-13,Signature,Bills,M,184410

In [3]:
df.head()

   index                   City       Date  Card Type Exp Type Gender  Amount
0      0           Delhi, India  29-Oct-14       Gold    Bills      F   82475
1      1  Greater Mumbai, India  22-Aug-14   Platinum    Bills      F   32555
2      2       Bengaluru, India  27-Aug-14     Silver    Bills      F  101738
3      3  Greater Mumbai, India  12-Apr-14  Signature    Bills      F  123424
4      4       Bengaluru, India   5-May-15       Gold    Bills      F  171574

In [4]:
df.tail()

       index              City       Date  Card Type Exp Type Gender  Amount
26047  26047    Kolkata, India  22-Jun-14     Silver   Travel      F  128191
26048  26048       Pune, India   3-Aug-14  Signature   Travel      M  246316
26049  26049  Hyderabad, India  16-Jan-15     Silver   Travel      M  265019
26050  26050     Kanpur, India  14-Sep-14     Silver   Travel      M   88174
26051  26051  Hyderabad, India  19-Oct-13  Signature    Bills      M  184410

In [5]:
df.columns

Index(['index', 'City', 'Date', 'Card Type', 'Exp Type', 'Gender', 'Amount'], dtype='object')

In [6]:
df.head()

   index                   City       Date  Card Type Exp Type Gender  Amount
0      0           Delhi, India  29-Oct-14       Gold    Bills      F   82475
1      1  Greater Mumbai, India  22-Aug-14   Platinum    Bills      F   32555
2      2       Bengaluru, India  27-Aug-14     Silver    Bills      F  101738
3      3  Greater Mumbai, India  12-Apr-14  Signature    Bills      F  123424
4      4       Bengaluru, India   5-May-15       Gold    Bills      F  171574

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26052 entries, 0 to 26051
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   index      26052 non-null  int64
 1   City       26052 non-null  object
 2   Date       26052 non-null  object
 3   Card Type  26052 non-null  object
 4   Exp Type   26052 non-null  object
 5   Gender     26052 non-null  object
 6   Amount     26052 non-null  int64
dtypes: int64(2), object(5)
memory usage: 1.4+ MB

In [8]:
df.isnull().sum()

index        0
City         0
Date         0
Card Type    0
Exp Type     0
Gender       0
Amount       0
dtype: int64

In [9]:
# No null values lets work on the right data types.

In [10]:
df["Date"]=pd.to_datetime(df["Date"])
df

,index,City,Date,Card Type,Exp Type,Gender,Amount
0,0,"Delhi, India",2014-10-29,Gold,Bills,F,82475
1,1,"Greater Mumbai, India",2014-08-22,Platinum,Bills,F,32555
2,2,"Bengaluru, India",2014-08-27,Silver,Bills,F,101738
3,3,"Greater Mumbai, India",2014-04-12,Signature,Bills,F,123424
4,4,"Bengaluru, India",2015-05-05,Gold,Bills,F,171574
...,...,...,...,...,...,...,...
26047,26047,"Kolkata, India",2014-06-22,Silver,Travel,F,128191
26048,26048,"Pune, India",2014-08-03,Signature,Travel,M,246316
26049,26049,"Hyderabad, India",2015-01-16,Silver,Travel,M,265019
26050,26050,"Kanpur, India",2014-09-14,Silver,Travel,M,88174
26051,26051,"Hyderabad, India",2013-10-19,Signature,Bills,M,184410

In [11]:
df.drop(["index"],axis=1, inplace=True)

In [12]:
df

                        City       Date  Card Type Exp Type Gender  Amount
0               Delhi, India 2014-10-29       Gold    Bills      F   82475
1      Greater Mumbai, India 2014-08-22   Platinum    Bills      F   32555
2           Bengaluru, India 2014-08-27     Silver    Bills      F  101738
3      Greater Mumbai, India 2014-04-12  Signature    Bills      F  123424
4           Bengaluru, India 2015-05-05       Gold    Bills      F  171574
...                      ...        ...        ...      ...    ...     ...
26047         Kolkata, India 2014-06-22     Silver   Travel      F  128191
26048            Pune, India 2014-08-03  Signature   Travel      M  246316
26049       Hyderabad, India 2015-01-16     Silver   Travel      M  265019
26050          Kanpur, India 2014-09-14     Silver   Travel      M   88174
26051       Hyderabad, India 2013-10-19  Signature    Bills      M  184410

[26052 rows x 6 columns]

In [13]:
df["Year"]=df["Date"].dt.year
df["Month"]=df["Date"].dt.month

In [14]:
df

,City,Date,Card Type,Exp Type,Gender,Amount,Year,Month
0,"Delhi, India",2014-10-29,Gold,Bills,F,82475,2014,10
1,"Greater Mumbai, India",2014-08-22,Platinum,Bills,F,32555,2014,8
2,"Bengaluru, India",2014-08-27,Silver,Bills,F,101738,2014,8
3,"Greater Mumbai, India",2014-04-12,Signature,Bills,F,123424,2014,4
4,"Bengaluru, India",2015-05-05,Gold,Bills,F,171574,2015,5
...,...,...,...,...,...,...,...,...
26047,"Kolkata, India",2014-06-22,Silver,Travel,F,128191,2014,6
26048,"Pune, India",2014-08-03,Signature,Travel,M,246316,2014,8
26049,"Hyderabad, India",2015-01-16,Silver,Travel,M,265019,2015,1
26050,"Kanpur, India",2014-09-14,Silver,Travel,M,88174,2014,9
26051,"Hyderabad, India",2013-10-19,Signature,Bills,M,184410,2013,10

In [15]:
df["Gender"]=df["Gender"].replace({"F":"Female","M":"Male"})

In [16]:
df

,City,Date,Card Type,Exp Type,Gender,Amount,Year,Month
0,"Delhi, India",2014-10-29,Gold,Bills,Female,82475,2014,10
1,"Greater Mumbai, India",2014-08-22,Platinum,Bills,Female,32555,2014,8
2,"Bengaluru, India",2014-08-27,Silver,Bills,Female,101738,2014,8
3,"Greater Mumbai, India",2014-04-12,Signature,Bills,Female,123424,2014,4
4,"Bengaluru, India",2015-05-05,Gold,Bills,Female,171574,2015,5
...,...,...,...,...,...,...,...,...
26047,"Kolkata, India",2014-06-22,Silver,Travel,Female,128191,2014,6
26048,"Pune, India",2014-08-03,Signature,Travel,Male,246316,2014,8
26049,"Hyderabad, India",2015-01-16,Silver,Travel,Male,265019,2015,1
26050,"Kanpur, India",2014-09-14,Silver,Travel,Male,88174,2014,9
26051,"Hyderabad, India",2013-10-19,Signature,Bills,Male,184410,2013,10

In [17]:
df.to_csv("cleaned_transactions.csv")